# 层次索引

In [1]:
import pandas as pd
import numpy as np

# series的层次索引

In [2]:

data = pd.Series([100,200,122,150,180],index = [['2016','2016','2016','2017','2017'],['苹果','香蕉','西瓜','苹果','西瓜']])
data

2016  苹果    100
      香蕉    200
      西瓜    122
2017  苹果    150
      西瓜    180
dtype: int64

# 选取子集

In [3]:
#外层选取
data['2016']

苹果    100
香蕉    200
西瓜    122
dtype: int64

In [7]:
#内层选取
data[:,'苹果']

2016    100
2017    150
dtype: int64

In [8]:
#外层+内层
data['2016','香蕉']

200

# 交换分层索引
swaplevel( )交换内层与外层索引。

In [9]:
data.swaplevel()

苹果  2016    100
香蕉  2016    200
西瓜  2016    122
苹果  2017    150
西瓜  2017    180
dtype: int64

In [87]:
#交换排序分层
data.swaplevel().sort_index()

苹果  2016    100
    2017    150
西瓜  2016    122
    2017    180
香蕉  2016    200
dtype: int64

In [33]:
#转变为DataFrame 索引的堆
data.unstack(level = 0 ) #level等于哪一列 哪一列就消失出现在列里
#逆转
# data.unstack().stack()

     2016   2017
苹果  100.0  150.0
西瓜  122.0  180.0
香蕉  200.0    NaN

# DataFrame层次索引

In [193]:
df = pd.DataFrame({
    'year':[2010,2010,2012,2012,2013],
    'fruit':['apple','banana','apple','banana','apple'],
    'production':[2345,3214,5663,2341,3523],
    'profits':[233.44,355.23,566.45,678.56,755.89]
})
df

    fruit  production  profits  year
0   apple        2345   233.44  2010
1  banana        3214   355.23  2010
2   apple        5663   566.45  2012
3  banana        2341   678.56  2012
4   apple        3523   755.89  2013

In [194]:
df = df.set_index(['year','fruit'])
df

             production  profits
year fruit
2010 apple         2345   233.44
     banana        3214   355.23
2012 apple         5663   566.45
     banana        2341   678.56
2013 apple         3523   755.89

In [195]:
#直接通过列名进行索引
df['production']

year  fruit
2010  apple     2345
      banana    3214
2012  apple     5663
      banana    2341
2013  apple     3523
Name: production, dtype: int64

In [196]:
#根据索引获取值
# df.loc[2010]
df.loc[2010,'apple']

production    2345.00
profits        233.44
Name: (2010, apple), dtype: float64

# 按照层次索引进行统计数据

In [91]:
# df.sum(level = 'year')
df.mean(level = 'fruit')

         production     profits
fruit
apple   3843.666667  518.593333
banana  2777.500000  516.895000

In [94]:
df.max(level='year')
# df.max(level='fruit')
# df.max(level=['year','fruit'])

        production  profits
fruit
apple         5663   755.89
banana        3214   678.56